# Напишите программу, которая принимает на вход число и проверяет, 
# кратно ли оно ((5 и 10) или 15), но не 30. 
# 20 -> Ok 45 -> Ok 150 -> Not Ok

a = int(input())
if (a % 5 == 0) & (a % 10 == 0) & (a % 30 != 0):
    print('Ok')
elif (a % 15 == 0) & (a % 30 != 0):
    print('Ok')
else:
    print('Not Ok')